<!-- dflook/terraform-github-actions {"workspace":"import-warnings-2","backend_type":"remote","backend":"887224126cdebb84f6e311e44a38909b2ba01af66c4c1270423f3bff3974a27b","plan_job_ref":"Job Test Terraform cloud #358 at https://github.com/dflook/terraform-github-actions/actions/runs/16830246757","plan_hash":"5351d155c12f53d8aac9905ed882528e95ca37a232dc6f42f02fc7bf4c43a62d","plan_text_format":"diff","version":"99.0.0","closed":true} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __import-warnings-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   default        = "default"
+   from_tfvars    = "from_tfvars"
+   from_variables = "from_variables"
```
</details>

:white_check_mark: Plan applied in [Test Terraform cloud #358](https://github.com/dflook/terraform-github-actions/actions/runs/16830246757)
<details open><summary>Outputs</summary>

```hcl
default        = "default"
from_tfvars    = "from_tfvars"
from_variables = "from_variables"
```
</details>